import {Component} from '@angular/core';

@Component({
  selector: 'app-about-us-page',
  templateUrl: './about-us-page.component.html',
  styleUrls: ['./about-us-page.component.scss']
})
export class AboutUsPageComponent {
  aboutUs: string[] = [
    'Привіт! Ми раді вітати вас на нашому веб-сайті, де ми з радістю розповімо про наш спортивний клуб.',
    'Наш спортивний клуб був заснований з метою допомогти людям досягати своїх спортивних цілей та зберігати здоров\'я. Ми віримо, що регулярні заняття спортом можуть позитивно впливати на життя людей, допомагаючи їм збільшувати енергію та підтримувати тіло в хорошій формі.',
    'У нашому клубі ми пропонуємо широкий спектр послуг, що включає в себе тренувальні заняття різної інтенсивності та складності, персональний тренінг, групові заняття, йогу та пілатес. Ми прагнемо створити для наших клієнтів максимально комфортні умови для занять спортом. У нашому спортивному залі знаходяться всі необхідні тренажери та інвентар, а також професійні тренери, які завжди готові надати вам підтримку та допомогти в досягненні ваших цілей.',
    'Наша команда складається з професіоналів, які мають багаторічний досвід роботи зі спортивними клубами та знають, як допомогти вам досягти максимальних результатів. Ми віримо, що спорт - це не просто фізичні вправи, але й ментальна готовність до перемоги та розвитку. Тому ми завжди намагаємося врахувати індивідуальні потреби кожного нашого клієнта, допомагаючи їм стати кращими версіями самих себе.',
    'Якщо ви шукаєте клуб, де ви зможете займатися спортом, підтримувати своє здоров\'я та отримувати задоволення від досягнення своїх цілей, то наш спортивний клуб - ідеальний вибір для вас. Ми створили унікальну атмосферу, де кожен може знайти щось для себе, незалежно від свого віку, рівня підготовки та фізичної форми.',
    'Наш клуб - це не тільки місце для занять спортом, а й спільнота людей, які прагнуть до здорового способу життя та розвитку. Ми організовуємо різноманітні заходи та змагання для наших клієнтів, щоб підтримувати їх мотивацію та позитивний настрій.',
    'Крім того, ми стежимо за тим, щоб наш спортивний клуб був максимально доступним для кожного. Ми пропонуємо гнучкий графік роботи, знижки для студентів та пенсіонерів, а також можливість купувати абонементи на різний термін.',
    'Ми віримо, що спорт - це не тільки здоров\'я, але й засіб досягнення ваших цілей та збереження позитивного настрою. Тому ми запрошуємо вас до нашого спортивного клубу, де ви зможете знайти все, що потрібно для досягнення своїх спортивних цілей та збереження здоров\'я. Давайте разом змінимо своє життя на краще!',
  ]
}
